# Base / build
base-devel
git
stow
sudo
gcc
make
cmake
perl

# CLI tools
curl
wget
man-db
man-pages
fastfetch
btop
bottom
ripgrep
fd
jq
pacman-contrib

# Shell / terminal
zsh
zsh-autosuggestions
zsh-syntax-highlighting
kitty

# Hyprland session
sddm
hyprland
uwsm
hyprland-protocols
hyprlang
hyprutils
hyprwayland-scanner
hypridle
hyprlock
hyprsunset
hyprpolkitagent
awww
wayland
xorg-xwayland
xdg-desktop-portal
xdg-desktop-portal-hyprland
xdg-desktop-portal-gtk
xdg-utils

# Bar / launcher / logout
waybar
rofi

# Notifications
swaync
libnotify

# Clipboard
wl-clipboard
cliphist

# Audio / media
pipewire
pipewire-alsa
pipewire-pulse
wireplumber
playerctl
pavucontrol
pamixer
alsa-utils

# Brightness / power
brightnessctl
power-profiles-daemon
upower

# Network / bluetooth
networkmanager
networkmanager-dmenu
nm-connection-editor
bluez
bluez-utils
blueman

# File manager
thunar

# Screenshots
hyprshot
satty

# Theme / appearance
qt6ct
kvantum
papirus-icon-theme
gnome-themes-extra
nwg-look

# Fonts
otf-font-awesome
ttf-jetbrains-mono-nerd

# Editor
neovim
